Revit 2027 API
ElectricalPhase Enumeration
An enumerated type to specify whether the electrical system is single phase or three phase.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalPhase
Public Enumeration ElectricalPhase
public enum class ElectricalPhase
type ElectricalPhase
Members
Member name | Value | Description
SinglePhase | 0 | Electrical phase is single phase.
ThreePhase | 1 | Electrical phase is three phase.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace